import { FC } from 'react';

const About: FC = () => {
  return (
    <section className='section about' id='about'>
      <h2 className='section__heading'>Как я полюбила разработку</h2>
      <p>
        Программирование стало для меня любимым делом, потому что сочетает в
        себе логику и&nbsp;творчество, позволяет &laquo;потрогать&raquo;
        современные технологии, а&nbsp;порой и&nbsp;принять участие
        в&nbsp;их&nbsp;создании, даёт возможности для постоянного обучения
        и&nbsp;развития (а&nbsp;учиться я&nbsp;люблю). Мне нравится видеть
        результаты своих трудов, нравится сознавать, что они могут быть полезны
        другим людям.
      </p>
    </section>
  );
};

export default About;
